# Basic SQL exercises

**Q1)** Write SQL statements to answer the questions using the following table.

Table name: salesman

 salesman_id |    name    |   city   | commission 
-------------|------------|----------|------------
        5001 | James Hoog | New York |       0.15
        5002 | Nail Knite | Paris    |       0.13
        5005 | Pit Alex   | London   |       0.11
        5006 | Mc Lyon    | Paris    |       0.14
        5007 | Paul Adam  | Rome     |       0.13
        5003 | Lauson Hen | San Jose |       0.12
        
1. Return all the salesman data for salesman that either comes from the city Paris or London.
2. Find the average commission for salesmen from Paris.
3. Find the salesman ids of those salesmen with names starting with the letter "P".

CREATE TABLE salesman(salesman_id INT, name CHAR(15), city CHAR(10), commission FLOAT, PRIMARY KEY(salesman_id));

INSERT INTO salesman VALUES (5001, 'James Hoog', 'New York', 0.15);<br>
INSERT INTO salesman VALUES (5002, 'Nail Knite', 'Paris', 0.13);<br>
INSERT INTO salesman VALUES (5005, 'Pit Alex', 'London', 0.11);<br>
INSERT INTO salesman VALUES (5006, 'Mc Lyon', 'Paris', 0.14);<br>
INSERT INTO salesman VALUES (5007, 'Paul Adam', 'Rome', 0.13);<br>
INSERT INTO salesman VALUES (5003, 'Lauson Hen', 'San Jose', 0.12);

SELECT * FROM salesman WHERE city='Paris' OR city='London'

SELECT AVG(commission) FROM salesman WHERE city='Paris'

SELECT salesman_id FROM salesman WHERE name LIKE "P%"

---
**Q2)** Write SQL statements to answer the questions using the following table. 

Table name: salesman

 salesman_id |    name    |   city   | commission 
-------------|------------|----------|------------
        5001 | James Hoog | New York |       0.15
        5002 | Nail Knite | Paris    |       0.13
        5005 | Pit Alex   | London   |       0.11
        5006 | Mc Lyon    | Paris    |       0.14
        5007 | Paul Adam  | Rome     |       0.13
        5003 | Lauson Hen | San Jose |       0.12
        
Table name: customer

 cust_id     |   cust_name    |    city    | grade | salesman_id 
-------------|----------------|------------|-------|-------------
        3002 | Nick Rimando   | New York   |   100 |        5001
        3007 | Brad Davis     | New York   |   200 |        5001
        3005 | Graham Zusi    | California |   200 |        5002
        3008 | Julian Green   | London     |   300 |        5002
        3004 | Fabian Johnson | Paris      |   300 |        5006
        3009 | Geoff Cameron  | Berlin     |   100 |        5003
        3003 | Jozy Altidor   | Moscow     |   200 |        5007
        3001 | Brad Guzan     | London     |   250 |        5005
        
1. Return both the customer's and salesmen's name and id who lives in the same city.
2. Return the salesman's name and id where customers have graded them over 250.
3. Customer Brad Davis have moved from New York to Hong Kong, update the customer's data to reflect this change.

In [ ]:
CREATE TABLE customer(cust_id CHAR(4) NOT NULL, cust_name CHAR(50) NOT NULL,
                     city CHAR(50) NOT NULL, grade INT, salesman_id CHAR(4),
                     PRIMARY KEY(cust_id),
                     FOREIGN KEY(salesman_id) REFERENCES salesman(salesman_id));
                     
INSERT INTO customer VALUES (3002,'Nick Rimando','New York',100,5001);
INSERT INTO customer VALUES (3007,'Brad Davis','New York',200,5001);
INSERT INTO customer VALUES (3005,'Graham Zusi','California',200,5002);
INSERT INTO customer VALUES (3008,'Julian Green','London',300,5002);
INSERT INTO customer VALUES (3004,'Fabian Johnson','Paris',300,5006);
INSERT INTO customer VALUES (3009,'Geoff Cameron','Berlin',100,5003);
INSERT INTO customer VALUES (3003,'Jozy Altidor','Moscow',200,5007);
INSERT INTO customer VALUES (3001,'Brad Guzan','London',200,5005);

In [ ]:
SELECT cust_name, name FROM customer, salesman WHERE customer.city = salesman.city;

SELECT salesman.name, salesman.salesman_id FROM salesman, customer WHERE customer.grade > 250 AND salesman.salesman_id = customer.salesman_id;

SELECT s.name, s.salesman_id FROM salesman AS s, customer AS c WHERE c.grade>250 AND s.salesman_id = c.salesman_id;

In [ ]:
UPDATE customer AS c SET city='Hong Kong' WHERE c.cust_name = 'Brad Davis';

---
**Qn 3)** Write a statement to create a table R consisting of 5 attributes a, b, c, d and e. The datatype of all the attributes are Integers. In addition, a and b are primary keys and d cannot be null.

In [ ]:
CREATE TABLE R (a INT, b INT, c INT, d INT NOT NULL, e INT, PRIMARY KEY(a,b));

---
**Q4)** Given the following database schema (from lecture notes) below, answer the following questions

**Student**(sID CHAR(8), sName CHAR(50), gender CHAR(1), age INT, dID CHAR(2), grade CHAR(2))    
**Dept**(dID CHAR(2), dName CHAR(20), dean CHAR(50))   
**Course**(cID CHAR(3), cName CHAR(50), hours INT, credit INT, iID CHAR(3))   
**Instructor**(iID CHAR(3), iName CHAR(50), dID CHAR(2), workload FLOAT)   
**RC**(sID CHAR(8), cID CHAR(3), score FLOAT)    

1. Find the names of the students who are taking the courses taught by "Lim".
2. Using the function aggregate function MAX(), find the oldest female student in the CS department.

##### QUESTION 4 PART 1
```sql
SELECT s.sName FROM Student AS s, Course AS c, Instructor AS i, Dept AS d WHERE i.iName LIKE "%Lim" AND i.iID = c.iID AND i.dID = d.dID AND d.dID = s.dID;
```

##### QUESTION 4 PART 2
```sql
SELECT s.sID FROM Student AS s, Dept AS d WHERE s.age = MAX(s.age) AND d.dID = 'CS' AND d.dID = s.dID;

Anthony Answer:
SELECT sName FROM Student WHERE dID='CS' AND age=(SELECT MAX(age) FROM Student);
```

#### Question 4 continues...
3. Using the not equal to operator (`<>`) (https://www.sqlshack.com/sql-not-equal-operator/) and the ORDER BY clause, find all the students who are not from the CS department and group them by department.
4. Using the GROUP BY clause, return the avg age of the students for each department.

### ORDER BY Syntax
```sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
```

### GROUP BY Syntax
```sql
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);
```

##### QUESTION 4 PART 3
```sql
SELECT s.sID FROM Student AS s, Dept AS d WHERE c.cName <> 'CS' GROUP BY s.sID ORDER BY s.sID ASC;
```

##### QUESTION 4 PART 4
```sql
SELECT AVG(s.age) FROM Student AS s, Dept AS d WHERE d.dID = s.dID GROUP BY d.dID;
```